app/controllers/clientes_controller.rb

SELECT * FROM `clientes`
---
	def lista
		@clientes = Cliente.all

INSERT INTO `clientes` (`correo_electronico`, `created_at`, `nombre`, `updated_at`, `cliente_id`, `rfc`, `direccion`) VALUES('jeremy@gmail.com', '2011-10-06 14:58:10', 'Jeremias Jones', '2011-10-06 14:58:10', NULL, 'jaa45467889', 'Camino de los alipuces 35000')
---
	def crear
		@cliente = Cliente.new(params[:cliente])
		if @cliente.save

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)
---
	def editar
		@cliente = Cliente.find(params[:id])

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 2)
UPDATE `clientes` SET `updated_at` = '2011-11-09 19:24:11', `correo_electronico` = 'camilo@marenco.com' WHERE `id` = 12
---
	def actualizar
		@cliente = Cliente.find(params[:id])
		if @cliente.update_attributes(params[:cliente])

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 3)
DELETE FROM `clientes` WHERE `id` = 3
---
	def borrar
		cliente = Cliente.find(params[:id])
		cliente.destroy