app/controllers/estatus_controller.rb

SELECT * FROM `estatus`
---
def lista
		@estatus = Estatu.all

INSERT INTO `estatus` (`created_at`, `updated_at`, `descripcion`, `lugar`, `estado`) VALUES('2011-11-16 21:59:10', '2011-11-16 21:59:10', NULL, NULL, NULL)
---
	def crear
		@estatu = Estatu.new(params[:estatu])
		if @estatu.save

SELECT * FROM `estatus` WHERE (`estatus`.`id` = 1)
---
	def editar
		@estatu = Estatu.find(params[:id])

SELECT * FROM `estatus` WHERE (`estatus`.`id` = 1)
UPDATE `estatus` SET `updated_at` = '2011-11-16 22:01:32', `estado` = 'Recepción', `lugar` = 'Monterrey', `descripcion` = 'Documentos recibidos incompletos' WHERE `id` = 1
---
	def actualizar
		@estatu = Estatu.find(params[:id])
		if @estatu.update_attributes(params[:estatu])