app/controllers/observacions_controller.rb

SELECT * FROM `observacions`
---
	def lista
		@observacions = Observacion.all

SELECT * FROM `estatus`
---
	def nuevo
		@observacion = Observacion.new
		@estatus = Estatu.all

INSERT INTO `observacions` (`tramite_id`, `comentario`, `estatus`, `created_at`, `updated_at`, `fecha_compromiso`) VALUES(NULL, 'hdhdhdhd\r\ndhdhdhdhdhd\r\nhdhdhdhdhdhd\r\nhdhdhdhdhdhdhd\r\n', 'uno', '2011-10-10 15:30:11', '2011-10-10 15:30:11', '2011-10-10')
---
	def crear
		@observacion = Observacion.new(params[:observacion])
		if @observacion.save

SELECT * FROM `observacions` WHERE (`observacions`.`id` = 2)
---
	def editar
		@observacion = Observacion.find(params[:id])

SELECT * FROM `observacions` WHERE (`observacions`.`id` = 2)
UPDATE `observacions` SET `updated_at` = '2011-10-28 21:26:07', `comentario` = 'Esta es una observación de ejemplo, ojala todo salga bien. Todo salió bien.' WHERE `id` = 2
---
	def actualizar
		@observacion = Observacion.find(params[:id])
		if @observacion.update_attributes(params[:observacion])

SELECT * FROM `observacions` WHERE (`observacions`.`id` = 1)
DELETE FROM `observacions` WHERE `id` = 1
---
	def borrar
		observacion = Observacion.find(params[:id])
		observacion.destroy