app/controllers/ordende_servicios_controller.rb

SELECT * FROM `ordende_servicios` WHERE (`ordende_servicios`.`id` = 1)
---
	def editar
		@ordendeServicio = OrdendeServicio.find(params[:id])