app/controllers/servicios_controller.rb

def lista
		@servicios = Servicio.all
---
SELECT * FROM `servicios`

	def crear
		@servicio = Servicio.new(params[:servicio])
		if @servicio.save
---
INSERT INTO `servicios` (`costo_consular_dolares`, `created_at`, `tipo_visa`, `dias_habiles_consulado`, `updated_at`, `dias_habiles_cliente`, `costo_consular_pesos`, `pais`, `costo_administrativo`) VALUES(1000, '2011-11-09 00:59:36', 'Clandestino', NULL, '2011-11-09 00:59:36', 20, NULL, 'Noruega', 500)

	def editar
		@servicio = Servicio.find(params[:id])
---
SELECT * FROM `servicios` WHERE (`servicios`.`id` = 1)

	def actualizar
		@servicio = Servicio.find(params[:id])
		if @servicio.update_attributes(params[:servicio])
---
SELECT * FROM `servicios` WHERE (`servicios`.`id` = 1)
UPDATE `servicios` SET `updated_at` = '2011-11-09 23:32:55', `dias_habiles_consulado` = 20 WHERE `id` = 3