app/controllers/telefonos_controller.rb

	def default
		@Atelefonos = Telefono.all
---
SELECT * FROM `telefonos`

	def borrar
		@telefono = Telefono.find(params[:id])
		@telefono.destroy
---
SELECT * FROM `telefonos` WHERE (`telefonos`.`id` = 1)
DELETE FROM `telefonos` WHERE `id` = 1

	def crear
		@telefono = Telefono.new(params[:telefono])
		if @telefono.save
			flash[:notice] = "Telefono agregado"
			redirect_to(:action => 'default')
		else
			flash[:notice] = "No se pudo agregar el telefono, revisa los datos."
			@Atelefonos = Telefono.all
---
INSERT INTO `telefonos` (`created_at`, `updated_at`, `cliente_id`, `descripcion`, `numero`) VALUES('2011-10-06 14:37:54', '2011-10-06 14:37:54', NULL, '1234567890', 'prueba')
SELECT * FROM `telefonos`