app/controllers/tramites_controller.rb

	def lista
		@tramites = Tramite.all
---
SELECT * FROM `tramites`

	def nuevo
		@tramite = Tramite.new
		@servicios = Servicio.all
---
SELECT * FROM `servicios`

	def crear
		@tramite = Tramite.new(params[:tramite])
		if @tramite.save
---
INSERT INTO `tramites` (`extranjero`, `created_at`, `nombre_pasajero`, `numero_pasaporte`, `fecha_entrega`, `updated_at`, `fecha_consular`, `ordenesdeservicio_id`, `pais`, `fecha_viaje`) VALUES(1, '2011-10-07 18:09:57', 'uno', '123456790', '2011-10-07', '2011-10-07 18:09:57', '2011-10-25', NULL, 'nueva zelanda', '2011-10-15 18:15:00')

	def editar
		@tramite = Tramite.find(params[:id])
---
SELECT * FROM `tramites` WHERE (`tramites`.`id` = 2)

	def actualizar
		@tramite = Tramite.find(params[:id])
		if @tramite.update_attributes(params[:tramite])
---
SELECT * FROM `tramites` WHERE (`tramites`.`id` = 2)
UPDATE `tramites` SET `updated_at` = '2011-10-28 21:12:18', `nombre_pasajero` = 'Roger Federev', `pais` = 'Suiza', `numero_pasaporte` = '8874573626129', `extranjero` = 1 WHERE `id` = 4

	def borrar
		tramite = Tramite.find(params[:id])
		tramite.destroy
---
SELECT * FROM `tramites` WHERE (`tramites`.`id` = 4)
DELETE FROM `tramites` WHERE `id` = 4